//*****************************************************
//
// ミサイルのビヘイビア[missileBehavior.xpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "missileBehavior.h"
#include "missile.h"

//*****************************************************
// 定数定義
//*****************************************************
namespace
{

}

//=====================================================
// 基底クラス
//=====================================================
CMissileBehavior::CMissileBehavior()
{// コンストラクタ

}

CMissileBehavior::~CMissileBehavior()
{// デストラクタ

}

//=====================================================
// 直線動きのミサイル
//=====================================================
CMissileLine::CMissileLine()
{// コンストラクタ

}

CMissileLine::~CMissileLine()
{// デストラクタ

}

void CMissileLine::Init(CMissile *pMissile)
{// 初期化

}

void CMissileLine::Uninit(CMissile *pMissile)
{// 初期化

}

void CMissileLine::Update(CMissile *pMissile)
{// 更新

}