//*****************************************************
//
// リザルトの処理[result.h]
// Author:高山桃也
//
//*****************************************************

#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************
// インクルード
//*****************************************************
#include "scene.h"

//*****************************************************
// 前方宣言
//*****************************************************
class CMeshCylinder;

//*****************************************************
// クラスの定義
//*****************************************************
class CResult : public CScene
{
public:
	
	CResult();	// コンストラクタ
	~CResult();	// デストラクタ

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	CMeshCylinder *m_pCylinder;	// 背景のシリンダー
};

#endif